#include "array_of_person.c"
#include "concatenation.c"
#include "map.c"
#include "where.c"
#include "array_of_person.h"
#include "concatenation.h"
#include "map.h"
#include "where.h"

int main(){
    setlocale(LC_ALL, "ru_RU.UTF-8");

    char choice;
    int running = 1;

    printf("+++ Выбери, что хочешь +++\n\n");

    while (running){
        show_buttons();

        printf("\nНажми нужную клавишу и Enter");
        scanf("%c", &choice);
        clean_input();

        printf("\n");

        switch(choice){

            case '1':
                printf("+++ Вы выбрали получить серию паспорта +++\n");
                //ВЫВОД функция
                break;
            case '2':
                printf("+++ Вы выбрали получить номер паспорта +++\n");
                //функция
                break;
            case '12':
                printf("+++ Вы выбрали получить id (серию и номер) +++\n");
                //функция
                break;
            case '3':
                printf("+++ Вы выбрали получить имя +++\n");
                //функция
                break;
            case '4':
                printf("+++ Вы выбрали получить фамилию +++\n");
                //функция
                break;
            case '5':
                printf("+++ Вы выбрали получить отчество +++\n");
                //функция
                break;
            case '345':
                printf("+++ Вы выбрали получить ФИО +++\n");
                //функция
                break;
            case '6':
                printf("+++ Вы выбрали получить год рождения +++\n");
                //функция
                break;
            case '7':
                printf("+++ Вы выбрали получить месяц рождения +++\n");
                //функция
                break;
            case '8':
                printf("+++ Вы выбрали получить день рождения +++\n");
                //функция
                break;
            case '678':
                printf("+++ Вы выбрали получить дату рождения +++\n");
                //функция
                break;
            case '17':
                printf("+++ Вы выбрали получить массив совершеннолетних людей +++\n");
                //функция
                break;
            case '33':
                printf("+++ Вы выбрали получить массив имен людей +++\n");
                //функция
                break;
            case '34':
                printf("+++ Вы выбрали получить массив сначала имен потом фамилий людей +++\n");
                //функция
                break;
    
            default:
                printf("+++ Ошибка: такой кнопки нет +++\n", choice);
                printf("Нажми Enter, чтобы продолжить");
                getchar();
                break;
            }
            printf("\n");
        }

    return 0;
}

void show_buttons(void){
    printf("-------------------------------\n");
    printf("|     Достыпные   функции     |\n");
    printf("|-----------------------------|\n");
    printf("|                             |\n");
    printf("|  +++++++++++++++++++++++++  |\n");
    printf("|  +           1           +  |\n");
    printf("|  +Получить серию паспорта+  |\n");
    printf("|  +++++++++++++++++++++++++  |\n");
    printf("|                             |\n");
    printf("|  +++++++++++++++++++++++++  |\n");
    printf("|  +           2           +  |\n");
    printf("|  +Получить номер паспорта+  |\n");
    printf("|  +++++++++++++++++++++++++  |\n");
    printf("|                             |\n");
    printf("|        +++++++++++++        |\n");
    printf("|        +     12    +        |\n");
    printf("|        +Получить id+        |\n");
    printf("|        +++++++++++++        |\n");
    printf("|                             |\n");
    printf("|       +++++++++++++++       |\n");
    printf("|       +      3      +       |\n");
    printf("|       +Получить  имя+       |\n");
    printf("|       +++++++++++++++       |\n");
    printf("|                             |\n");
    printf("|     +++++++++++++++++++     |\n");
    printf("|     +        4        +     |\n");
    printf("|     +Получить  фамилию+     |\n");
    printf("|     +++++++++++++++++++     |\n");
    printf("|                             |\n");
    printf("|     +++++++++++++++++++     |\n");
    printf("|     +        5        +     |\n");
    printf("|     +Получить отчество+     |\n");
    printf("|     +++++++++++++++++++     |\n");
    printf("|                             |\n");
    printf("|       +++++++++++++++       |\n");
    printf("|       +     345     +       |\n");
    printf("|       +Получить  ФИО+       |\n");
    printf("|       +++++++++++++++       |\n");
    printf("|                             |\n");
    printf("|   +++++++++++++++++++++++   |\n");
    printf("|   +          6          +   |\n");
    printf("|   +Получить год рождения+   |\n");
    printf("|   +++++++++++++++++++++++   |\n");
    printf("|                             |\n");
    printf("|  +++++++++++++++++++++++++  |\n");
    printf("|  +           7           +  |\n");
    printf("|  +Получить месяц рождения+  |\n");
    printf("|  +++++++++++++++++++++++++  |\n");
    printf("|                             |\n");
    printf("|   ++++++++++++++++++++++++  |\n");
    printf("|   +          8           +  |\n");
    printf("|   +Получить день рождения+  |\n");
    printf("|   ++++++++++++++++++++++++  |\n");
    printf("|                             |\n");
    printf("|   ++++++++++++++++++++++++  |\n");
    printf("|   +         678          +  |\n");
    printf("|   +Получить дату рождения+  |\n");
    printf("|   ++++++++++++++++++++++++  |\n");
    printf("|                             |\n");
    printf("| +++++++++++++++++++++++++++ |\n");
    printf("| +           17            + |\n");
    printf("| +Получить массив людей >17+ |\n");
    printf("| +++++++++++++++++++++++++++ |\n");
    printf("|                             |\n");
    printf("|+++++++++++++++++++++++++++++|\n");
    printf("|+            33             +|\n");
    printf("|+Получить  массив имен людей+|\n");
    printf("|+++++++++++++++++++++++++++++|\n");
    printf("|                             |\n");
    printf("|+++++++++++++++++++++++++++++|\n");
    printf("|+            34             +|\n");
    printf("|+Получить массив имена, фам.+|\n");
    printf("|+++++++++++++++++++++++++++++|\n");
    printf("|                             |\n");
    printf("|-----------------------------|\n");
    printf("|            Всё              |\n");
    printf("-------------------------------\n");
}